app/Models/DataModel.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `data`